/**
 * @Description:TODO(这里用一句话描述这个类的作用)
 * @author: 彭立
 * @date: 2018年9月2日 下午7:43:25
 * 
 */
package com.pl.demo1;

/**
 * 
 * 英文字母和中文汉字在不同字符集编码下的字节数 英文字母：
 * 
 * 字节数 : 1;编码：GB2312
 * 
 * 字节数 : 1;编码：GBK
 * 
 * 字节数 : 1;编码：GB18030
 * 
 * 字节数 : 1;编码：ISO-8859-1
 * 
 * 字节数 : 1;编码：UTF-8
 * 
 * 字节数 : 4;编码：UTF-16
 * 
 * 字节数 : 2;编码：UTF-16BE
 * 
 * 字节数 : 2;编码：UTF-16LE
 * 
 * 
 * 
 * 中文汉字：
 * 
 * 字节数 : 2;编码：GB2312
 * 
 * 字节数 : 2;编码：GBK
 * 
 * 字节数 : 2;编码：GB18030
 * 
 * 字节数 : 1;编码：ISO-8859-1
 * 
 * 字节数 : 3;编码：UTF-8
 * 
 * 字节数 : 4;编码：UTF-16
 * 
 * 字节数 : 2;编码：UTF-16BE
 * 
 * 字节数 : 2;编码：UTF-16LE
 * 
 */